Gets a reference to the current document.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
  Since:  2018
 Syntax
  C#
public Document GetDocument()
  Visual Basic
Public Function GetDocument As Document
  Visual C++
public:
Document^ GetDocument()
 Return Value
 Returns a reference to the current document.
 See Also
  RebarUpdateCurvesData Class
  Autodesk.Revit.DB.Structure Namespace